Revit 2023 API
FabricationConfiguration.GetSpecificationAbbreviation Method
 Gets specification abreviation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public string GetSpecificationAbbreviation(
	int specificationId
)
Visual Basic
Public Function GetSpecificationAbbreviation ( _
	specificationId As Integer _
) As String
Visual C++
public:
String^ GetSpecificationAbbreviation(
	int specificationId
)
Parameters
specificationId
Type: System.Int32
 The specification identifier.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace